---
kind: property
id: P:Autodesk.Revit.DB.Visual.Checker.TextureRealWorldOffsetY
source: html/bf02034c-caf9-3ed1-db99-fe47b4af6a3c.htm
---
# Autodesk.Revit.DB.Visual.Checker.TextureRealWorldOffsetY Property

The property labeled "Offset Y" from the "Checker" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldOffsetY { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".